week8/day1/reddit_clone/app/views/subs/index.html.erb

SELECT "subs".* FROM "subs"
---
<ul>
    <% Sub.all.each do |sub| %>