week6/day2/RouteControllerProj/app/controllers/artwork_shares_controller.rb

    def destroy #unshare
        share = ArtworkShare.find(params[:id])

        share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]

    def create #share
        share = ArtworkShare.new(artwork_share_params)
        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 4], ["created_at", "2020-12-30 22:43:08.391236"], ["updated_at", "2020-12-30 22:43:08.391236"]]