week6/day2/RouteControllerProj/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "art"], ["img_url", "a.com"], ["artist_id", 5], ["created_at", "2020-12-30 22:23:25.942214"], ["updated_at", "2020-12-30 22:23:25.942214"]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #debugger
        render json: Artwork.find(params[:id])