week6/day2/RouteControllerProj/app/controllers/users_controller.rb

    def update
        debugger
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "edwin"], ["email", "edwin.email"], ["updated_at", "2020-12-29 23:38:33.823450"], ["id", 2]]