week8/day1/reddit_clone/app/views/posts/new.html.erb

    <label>List of subs:
        <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"