week7/day2/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "ckAmhI9G09rSSXR2_vzvVQ"], ["LIMIT", 1]]
---
    def current_user
        return nil unless session[:session_token] ##this line is good practice
       @current_user ||= User.find_by(session_token: session[:session_token])