week8/day1/reddit_clone/app/views/users/index.html.erb

<div>
    <% User.all.each do |user|%>
---
SELECT "users".* FROM "users"