week8/day1/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at", "sub_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdfgag"], ["url", "asdgasdg"], ["content", "asdgadfhdhjk"], ["author_id", 2], ["created_at", "2021-01-11 22:30:44.855502"], ["updated_at", "2021-01-11 22:30:44.855502"], ["sub_id", 1]]
---
    def create
        @post = current_user.posts.new(post_params)
       # @post.sub_id = params[:sub_id]
        if @post.save