week8/day1/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "abc"], ["description", "123"], ["moderator_id", 2], ["created_at", "2021-01-11 19:28:33.584243"], ["updated_at", "2021-01-11 19:28:33.584243"]]

    def update
        @sub = Sub.find_by(id: params[:id])

        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "abcd"], ["description", "12345"], ["updated_at", "2021-01-11 19:40:14.554965"], ["id", 1]]